regno, name, 3 course marks

In [2]:
import pandas as pd

In [8]:
data = {'Reg_no': [101,102,103,104,105],
        'Name': ['A','B','C','D','E'],
        'Course1': [99,93,92,90,89],
        'Course2': [66,89,45,78,77],
        'Course3': [90,80,85,35,77],}
df = pd.DataFrame(data)
df = df.set_index('Reg_no')
print(df)

       Name  Course1  Course2  Course3
Reg_no
101       A       99       66       90
102       B       93       89       80
103       C       92       45       85
104       D       90       78       35
105       E       89       77       77

In [4]:
cols = input("Enter Columns to view separated by comma\n").split(',')
cols = [col.strip() for col in cols]
cols1 = df[cols]
print(cols1)

KeyError: "None of [Index([''], dtype='object')] are in the [columns]"

In [5]:
df

       Name  Course1  Course2  Course3
Reg_no
101       A       99       66       90
102       B       93       89       80
103       C       92       45       85
104       D       90       78       35
105       E       89       77       77

Reg. no, name, course-1 mark of 2,3

In [ ]:
df.iloc[1:4,0:2]

       Name  Course1
Reg_no
102       B       93
103       C       92
104       D       90

In [ ]:
df.loc[102:104, ['Name','Course1']]

       Name  Course1
Reg_no
102       B       93
103       C       92
104       D       90

In [ ]:
df3 = df.copy()
df3.loc[103,['Course1','Course2','Course3']] = 100
print(df3)

       Name  Course1  Course2  Course3
Reg_no
101       A       99       66       90
102       B       93       89       80
103       C      100      100      100
104       D       90       78       35
105       E       89       77       77

In [ ]:
df[(df['Course1']<=50) | (df['Course2']<=50) | (df['Course3']<=50 )]

       Name  Course1  Course2  Course3
Reg_no
103       C       92       45       85
104       D       90       78       35

In [ ]:
df['Name'][(df['Course1']<=50) | (df['Course2']<=50) | (df['Course3']<=50 )]

Reg_no
103    C
104    D
Name: Name, dtype: object

In [51]:
data2 = {'Courses': ['C1','C2','C3','C4','C5'],
        'student1': [99,93,92,90,89],
        'student2': [66,89,45,78,77],
        'student3': [90,80,85,35,77],}
df2 = pd.DataFrame(data2)
df2

  Courses  student1  student2  student3
0      C1        99        66        90
1      C2        93        89        80
2      C3        92        45        85
3      C4        90        78        35
4      C5        89        77        77

In [52]:
df2 = df2.set_index('Courses')

In [53]:
df2.loc['C1'] += 50

In [54]:
df2

         student1  student2  student3
Courses
C1            149       116       140
C2             93        89        80
C3             92        45        85
C4             90        78        35
C5             89        77        77

In [55]:
df2.reset_index()

  Courses  student1  student2  student3
0      C1       149       116       140
1      C2        93        89        80
2      C3        92        45        85
3      C4        90        78        35
4      C5        89        77        77

In [58]:
df2 = df2.groupby('Courses').apply(lambda c1: c1 + 10 if c1.name == 'C1' else c1).reset_index(level=0, drop=True)

In [59]:
df2

         student1  student2  student3
Courses
C1            169       136       160
C2             93        89        80
C3             92        45        85
C4             90        78        35
C5             89        77        77